Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: If you tried to do this without a generic where clause, you would have a problem: The implementation of isTop(_:) uses the == operator, but the definition of Stack doesn’t require its items to be equatable, so using the == operator results in a compile-time error.
ja: あなたが総称体where節なしにこれをしようとするならば、あなたは問題を抱えることになるでしょう：isTop(_:)の実装は==演算子を使います、しかしStackの定義はそれの項目に同等評価可能であることを要求しません、それで==演算子の使用はコンパイル時エラーという結果になります。

source: If you try adding one, the next issue you’ll encounter is that the == operator needs to know the types of its left-hand and right-hand arguments.
ja: あなたがそれを加えることを試みるならば、あなたがぶつかる次の問題は、==演算子はそれの左手および右手の引数の型を知る必要があることです。

source: If you try to access numberOfRooms with the same optional chaining as before, it will now return an Int? that contains the default numberOfRooms value of 1:
ja: あなたが前と同じオプショナル連鎖でnumberOfRoomsにアクセスしようとするならば、それは今では省略時のnumberOfRooms値の1を含むInt?を返します：

source: If you try to access an unsafe unowned reference after the instance that it refers to is deallocated, your program will try to access the memory location where the instance used to be, which is an unsafe operation.
ja: あなたが安全でない非所有参照に、それが参照するインスタンスがデアロケートされてしまった後にアクセスすることを試みるならば、あなたのプログラムはそのインスタンスが存在するのに使われたところの位置でメモリにアクセスしようと試みるでしょう、それはメモリ安全ではない操作です。

source: If you try to access or modify a value for an index that is outside of an array’s existing bounds, you will trigger a runtime error.
ja: あなたが配列のもつ存在する境界の外にあるインデックスに対する値にアクセスまたは変更しようとするならば、あなたは実行時エラーの引き金を引くことになります。

source: If you try to access the numberOfRooms property of this person’s residence, by placing an exclamation point after residence to force the unwrapping of its value, you trigger a runtime error, because there is no residence value to unwrap:
ja: あなたがこの人のresidenceのnumberOfRoomsプロパティに、その値を強制アンラップするためresidenceの後に感嘆符を置くことによって、アクセスしようとするならば、あなたは実行時エラーを引き起こします、なぜなら、アンラップするresidence値はないからです：

source: If you try to access the value of an unowned reference after that instance has been deallocated, you’ll get a runtime error.
ja: あなたがある非所有参照の値に、そのインスタンスがデアロケートされてしまった後にアクセスしようとするならば、あなたは実行時エラーを得るでしょう。

source: If you try to access the variable or property after the object has been deallocated, a runtime error is raised.
ja: あなたが変数またはプロパティにそのオブジェクトがデアロケートされてしまった後にアクセスすることを試みるならば、実行時エラーが引き起こされます。

source: If you try to access the variable or property after the object has been deallocated, you’ll access the memory at the location where the object used to be, which is a memory-unsafe operation.
ja: あなたが変数またはプロパティに、そのオブジェクトがデアロケートされてしまった後にアクセスすることを試みるならば、あなたはそのオブジェクトが存在するのに使われたところの位置でメモリにアクセスするでしょう、それはメモリ安全ではない操作です。

source: If you try to call the isTop(_:) method on a stack whose elements aren’t equatable, you’ll get a compile-time error.
ja: あなたがisTop(_:)メソッドを、それの持つ要素が同等評価可能でないスタック上で呼び出そうとするならば、あなたはコンパイル時エラーを得るでしょう。

source: If you try to create a CartItem instance with a quantity value of 0, the CartItem initializer causes initialization to fail:
ja: あなたがCartItemインスタンスを0のquantity値で作成することを試みるならば、CartItemイニシャライザが初期化を失敗する原因となります：

source: If you try to find a planet with a position of 11, the optional Planet value returned by the raw value initializer will be nil:
ja: あなたが11の位置で惑星を見つけようとするならば、生の値のイニシャライザによって返されるオプショナルのPlanet値は、nilになります：

source: If you try to insert a number into an integer constant or variable that cannot hold that value, by default Swift reports an error rather than allowing an invalid value to be created.
ja: あなたがある数をその値を持つことができない整数の定数や変数の中へ入れようとするならば、初期状態では、スウィフトは無効な値がつくられるようにするのではなく、エラーを報告します。

source: If you try to retrieve an Int value through optional chaining, an Int? is always returned, no matter how many levels of chaining are used.
ja: あなたがオプショナル連鎖を通してInt値を取り出そうと試すならば、Int?が常に返されます、どんなに多くの連鎖階層が使われようともです。

source: If you try to set the currentLevel of the right channel to 11, you can see that the right channel’s currentLevel property is capped to the maximum value of 10, and the maxInputLevelForAllChannels type property is updated to equal 10:
ja: あなたが右のチャンネルのcurrentLevelを11に設定しようとするならば、あなたは右のチャンネルのcurrentLevelプロパティが最大値の10に制限されるのを見ることができます、そして型プロパティmaxInputLevelForAllChannelsは10に等しくなるよう更新されます：

source: If you try to use an implicitly unwrapped optional that has a value of nil, you’ll get a runtime error.
ja: あなたがnilの値を持つ暗黙的にアンラップされるオプショナルを使うことを試みるならば、あなたは実行時エラーを得るでしょう。

source: If you use a capture list, you must also use the in keyword, even if you omit the parameter names, parameter types, and return type.
ja: あなたがキャプチャリストを使うならば、あなたはまたinキーワードも使わなければなりません、たとえあなたがパラメータ名、パラメータ型、そして戻り型を省略するとしてもです。

source: If you use a closure to initialize a property, remember that the rest of the instance has not yet been initialized at the point that the closure is executed.
ja: あなたがプロパティを初期化するためにクロージャを使うならば、そのクロージャが実行される時点で、残りのインスタンスはまだ初期化されていないのを思い出してください。

source: If you use an extension to add an initializer to a structure that was declared in another module, the new initializer can’t access self until it calls an initializer from the defining module.
ja: あなたが拡張を使ってイニシャライザを別のモジュールの中で宣言された構造体へと加えるならば、その新しいイニシャライザはselfにアクセスすることが、それがあるイニシャライザを定義されているモジュールから呼び出すまでは出来ません。

source: If you use an extension to add an initializer to a value type that provides default values for all of its stored properties and does not define any custom initializers, you can call the default initializer and memberwise initializer for that value type from within your extension’s initializer.
ja: あなたが拡張を、その格納プロパティの全てに省略時の値を与えて全くあつらえのイニシャライザを定義しない値型に、イニシャライザを加えるために使うならば、あなたはその値型のための省略時のイニシャライザとメンバー関連イニシャライザを、あなたの拡張のイニシャライザ内から呼ぶことができます。

source: If you use more than one number sign to form a string delimited by extended delimiters, don’t place whitespace in between the number signs:
ja: あなたが１つ以上のシャープ記号を使って拡張区切り記号によって区切られる文字列を形成するならば、空白をシャープ記号の間に置かないでください：

source: If you use multiple available attributes, the effective availability is the combination of the platform and Swift availabilities.
ja: あなたが複数のavailable属性を使うならば、有効な利用可能性はプラットホームとスウィフト利用可能性の組み合わせとなります。

source: If you use these shorthand argument names within your closure expression, you can omit the closure’s argument list from its definition, and the number and type of the shorthand argument names will be inferred from the expected function type.
ja: あなたがこれらの短縮形引数名をあなたのクロージャ式の中で使用するならば、あなたはクロージャの引数リストをその定義から省略することができます、そして、短縮形引数名の数と型は期待される関数型から推論されます。

source: If you want a custom subclass to present one or more of the same initializers as its superclass, you can provide a custom implementation of those initializers within the subclass.
ja: あなたが、あるあつらえのサブクラスにそれのスーパークラスと同じイニシャライザがひとつ以上存在することを望むならば、あなたはそれらのイニシャライザのあつらえの実装をそのサブクラスにおいて提供することができます。

source: If you want a function to modify a parameter’s value, and you want those changes to persist after the function call has ended, define that parameter as an in-out parameter instead.
ja: あなたがある関数にパラメータの値を修正して欲しいならば、そしてあなたが関数呼び出しが終わった後それらの変化に存続して欲しいならば、代わりにそのパラメータをin-outパラメータとして定義してください。

source: If you want a nested type within a public type to be publicly available, you must explicitly declare the nested type as public.
ja: あなたが公開型の内側で入れ子にされた型に公開的に利用できて欲しいならば、あなたは明確に入れ子にされた型を公開として宣言しなければなりません。

source: If you want a public type to be initializable with a no-argument initializer when used in another module, you must explicitly provide a public no-argument initializer yourself as part of the type’s definition.
ja: あなたがある公開型を別のモジュール内で使うときに引数のないイニシャライザを使って初期化できるようにしたいならば、あなたはある公開の引数のないイニシャライザをあなた自身でその型定義の一部として明示的に提供しなければなりません。

source: If you want a type member to be public, you must explicitly mark it as such.
ja: あなたが型のメンバーに公開であって欲しいならば、あなたは明確にそれをそのように印しなければなりません。

source: If you want an autoclosure that is allowed to escape, use both the @autoclosure and @escaping attributes.
ja: あなたが脱出を許可される自動クロージャを望むならば、@autoclosureと@escaping属性を両方とも使ってください。

source: If you want to assign an explicit access level to a protocol type, do so at the point that you define the protocol.
ja: あなたが明確なアクセス水準をあるプロトコル型に割り当てたいならば、あなたがそのプロトコルを定義する時点でそうしてください。

source: If you want to observe changes to a property’s value, and you are already providing a custom setter for that property, you can simply observe any value changes from within the custom setter.
ja: あなたがあるプロパティの値に対する変更を監視したい、そしてあなたが既にあつらえのセッターをそのプロパティのために提供しているならば、あなたは簡単にあつらえのセッター内からどんな値の変化でも監視することができます。

source: If you want to perform further optional chaining on this method’s return value, place the optional chaining question mark after the method’s parentheses:
ja: あなたがこのメソッドの戻り値の上でさらにオプショナル連鎖を実行したいならば、メソッドの丸括弧の後にオプショナル連鎖の疑問符を置いてください：

source: If you want to remove the final item from an array, use the removeLast() method rather than the remove(at:) method to avoid the need to query the array’s count property.
ja: あなたが配列から最後の項目を取り除きたいならば、removeLast()メソッドをremove(at:)メソッドよりむしろ使用して、配列のcountプロパティについてたずねる必要を避けるようにしてください。

source: If you want to specify an explicit access level for a custom type, do so at the point that you define the type.
ja: あなたがあつらえの型のために明示的にアクセス水準を指定したいならば、あなたが型を定義する時点でそうしてください。

source: If you want to swap two String values, or two Double values, you have to write more functions, such as the swapTwoStrings(_:_:) and swapTwoDoubles(_:_:) functions shown below:
ja: あなたが２つのString値、または２つのDoubleの値を交換したいならば、あなたはより多くの関数を書かなければなりません、例えば以下で示されるswapTwoStrings(_:_:)とswapTwoDoubles(_:_:)関数のように：

source: If you want to use line breaks to make your source code easier to read, but you don’t want the line breaks to be part of the string’s value, write a backslash (\) at the end of those lines:
ja: あなたが改行を使うことであなたのソースコードを読みやすくしたい、しかしあなたがその改行に文字列の値の一部であることを望まないならば、バックスラッシュを（\）それらの行の終わりに書いてください：

source: If you want your custom value type to be initializable with the default initializer and memberwise initializer, and also with your own custom initializers, write your custom initializers in an extension rather than as part of the value type’s original implementation.
ja: あなたが、あなたのあつらえの値型に省略時のイニシャライザとメンバー関連イニシャライザで、その上にあなた自身のあつらえのイニシャライザで初期化可能にされて欲しいならば、あなたのあつらえのイニシャライザを値型の元々の実装の一部としてではなく、ある拡張の中で書いてください。

source: If you wanted to manipulate the value of actualNumber within the first branch of the if statement, you could write if var actualNumber instead, and the value contained within the optional would be made available as a variable rather than a constant.
ja: あなたがactualNumberの値をif文の最初の分岐内で取り扱うことを望むならば、あなたはif var actualNumberを代わりに書くことができたでしょう、そしてオプショナル内部に含まれる値は定数ではなく変数として利用可能にされたでしょう。

source: If you write inout in front of a parameter’s type, the parameter can be modified inside the scope of the function.
ja: あなたがinoutをパラメータの型のすぐ前に書くならば、そのパラメータは関数のスコープ内部において修正されることができます。

source: If your code does contain conflicts, you’ll get a compile-time or runtime error.
ja: あなたのコードが衝突を含むならば、あなたはコンパイル時または実行時エラーを得るでしょう。

source: If your custom type has a stored property that is logically allowed to have “no value”—perhaps because its value cannot be set during initialization, or because it is allowed to have “no value” at some later point—declare the property with an optional type.
ja: あなたの特注で作った型が論理的に「無い値」を持つことを許される格納プロパティを ― もしかしたらそれの値が初期化の間に設定されることができないかもしれないため、または後の時点でそれが「無い値」を持つことを許されるため ― 持つならば、そのプロパティをオプショナルの型で宣言してください。

source: If your data structure is likely to be more complex, model it as a class or structure, rather than as a tuple.
ja: あなたのデータ構造体がより複雑になるようならば、それをクラスまたは構造体として形作ってください、タプルとしてよりも。

source: If your subclass doesn’t define any designated initializers, it automatically inherits all of its superclass designated initializers.
ja: あなたのサブクラスがまったく指定イニシャライザを定義しないならば、それは自動的にそれのスーパークラスの指定イニシャライザの全てを継承します。

source: If your subclass provides an implementation of all of its superclass designated initializers—either by inheriting them as per rule 1, or by providing a custom implementation as part of its definition—then it automatically inherits all of the superclass convenience initializers.
ja: もしあなたのサブクラスがそれのスーパークラスの指定イニシャライザの実装の全てを ― 規則１に従ってそれらを継承することによって、またはあつらえの実装をそれの定義の一部として提供することによってのどちらかで ― 提供するならば、その時それは自動的にスーパークラスの便宜イニシャライザの全てを継承します。

source: If your turn ends at the bottom of a ladder, you move up that ladder.
ja: あなたの番がはしごの下で終わるならば、あなたはそのはしごを上ります。

source: If your turn ends at the head of a snake, you move down that snake.
ja: あなたの番がヘビの頭のところで終わるならば、あなたはそのヘビを下ります。

source: If you’re implementing a prefix or postfix operator, you must also mark that method declaration with the corresponding prefix or postfix declaration modifier.
ja: あなたが接頭辞または接尾辞演算子を実装しているならば、あなたはまたそのメソッド宣言を対応するprefixまたはpostfix宣言修飾子で印をしなければなりません。

source: If you’re using multiline string literals to build up the lines of a longer string, you want every line in the string to end with a line break, including the last line.
ja: あなたが複数行文字列リテラルを使ってたくさんの行の長い文字列を作り上げようとしているならば、あなたはその文字列のすべての行を、最後の行を含めて改行で終わりたいと思うでしょう。

source: If you’ve written concurrent or multithreaded code, conflicting access to memory might be a familiar problem.
ja: あなたが並列のまたはマルチスレッドのコードを書いたことがあるならば、メモリアクセスの衝突はおなじみの問題でしょう。

source: Implement an area() and a simpleDescription() method on the Circle class.
ja: area()およびsimpleDescription()メソッドをCircleクラス上で実装してください。

source: Implicit Member Expression
ja: 暗黙のメンバー式

source: Implicit Returns from Single-Expression Closures
ja: 単一式のクロージャからの値を暗黙的に返す

source: Implicit returns from single-expression closures
ja: 単一式のクロージャからの値を暗黙的に返す

source: Implicitly Assigned Raw Values
ja: 暗黙的に割り当てられる生の値

source: Implicitly Unwrapped Optional Type
ja: 暗黙的にアンラップされるオプショナルの型

source: Implicitly Unwrapped Optionals
ja: 暗黙的にアンラップされるオプショナル

source: Implicitly unwrapped optionals are useful when an optional’s value is confirmed to exist immediately after the optional is first defined and can definitely be assumed to exist at every point thereafter.
ja: 暗黙的にアンラップされるオプショナルは、あるオプショナルの値が存在するのをそのオプショナルが最初に定義された直後に確かめられて、それ以降あらゆる所で存在するのを自信を持って仮定出来るようにされる場合に役に立ちます。

source: Import Declaration
ja: インポート宣言

source: Important
ja: 重要

source: Improved the discussion of autoclosures in the Autoclosures section.
ja: 自動クロージャの説明を自動クロージャ節において改善した。

source: In Blackjack, the Ace cards have a value of either one or eleven.
ja: ブラックジャックにおいて、「エース」のカードは、１または11のどちらかの値を持ちます。

source: In C and Objective-C, you define static constants and variables associated with a type as global static variables.
ja: CとObjective-Cでは、あなたは静的定数およびグローバルな静的変数として型と結びついた変数を定義します。

source: In Objective-C, nil is a pointer to a nonexistent object.
ja: Objective-Cでは、nilは、ある存在しないオブジェクトへのポインターです。

source: In Objective-C, classes are the only types that can define methods.
ja: Objective-Cでは、クラスはメソッドを定義することができる唯一の型です。

source: In Objective-C, you can define type-level methods only for Objective-C classes.
ja: Objective-Cでは、あなたはObjective-Cクラスのためにだけ型レベルのメソッドを定義することができます。

source: In Swift, switch statements don’t fall through the bottom of each case and into the next one.
ja: スウィフトでは、switch文は、それぞれのケース節の底を抜け落ちて次のものにいきません。

source: In Swift, nil isn’t a pointer—it’s the absence of a value of a certain type.
ja: スウィフトでは、nilはポインターではありません ― それは、ある特定の型のある値の不在です。

source: In Swift, an enumeration to define product barcodes of either type might look like this:
ja: スウィフトにおいて、両方の種類の製品バーコードを定義する列挙は、これのように見えるかもしれません：

source: In Swift, as in C, the remainder operator (%) and the multiplication operator (*) have a higher precedence than the addition operator (+).
ja: スウィフトでは、Cでのように、剰余演算子（%）と乗算演算子（*）は、加算演算子（+）より高い優先順位を持ちます。

source: In Swift, as in Objective-C, protocol conformance is global—it isn’t possible for a type to conform to a protocol in two different ways within the same program.
ja: スウィフトにおいて、Objective-Cにおいてと同様に、プロトコル準拠はグローバルです ― ひとつの型にとって、同じプログラム内でひとつのプロトコルに２つの異なる方法で準拠することは、可能ではありません。

source: In Swift, errors are represented by values of types that conform to the Error protocol.
ja: スウィフトでは、エラーはErrorプロトコルに準拠する型の値によって表されます。

source: In Swift, every possible value of the control expression’s type must match the value of at least one pattern of a case.
ja: スウィフトにおいて、制御式のもつ型のあらゆる可能な値は、少なくともあるケース節の１つのパターンの値にマッチしなければなりません。

source: In Swift, however, type properties are written as part of the type’s definition, within the type’s outer curly braces, and each type property is explicitly scoped to the type it supports.
ja: スウィフトでは、しかしながら、型プロパティは、型の定義の一部として、型の外縁の波括弧の内部に書かれます、そして各型プロパティは、明確にそれが支持する型にスコープを定められます。

source: In Swift, most declarations are also definitions in the sense that they are implemented or initialized at the same time they are declared.
ja: スウィフトにおいて、大部分の宣言はまた、それらが宣言されるのと同時にそれらが実装または初期化されるという意味で定義されます。

source: In Swift, the simplest form of a closure that can capture values is a nested function, written within the body of another function.
ja: スウィフトにおいて、値をキャプチャできるクロージャの最も単純な形式は、別の関数の本文内に書かれる、入れ子にされた関数です。

source: In Swift, there are four kinds of expressions: prefix expressions, binary expressions, primary expressions, and postfix expressions.
ja: スウィフトには、４種類の式があります：接頭辞式、二項式、基本式、そして接尾辞式。

source: In Swift, there are three kinds of statements: simple statements, compiler control statements, and control flow statements.
ja: スウィフトには、３種類の文があります：単純な文、コンパイラ制御文、そして制御の流れ文。

source: In Swift, there are two basic kinds of patterns: those that successfully match any kind of value, and those that may fail to match a specified value at runtime.
ja: スウィフトには、２つの基本的な種類のパターンがあります：あらゆる種類の値に成功裏にマッチするものたち、そして指定された値にマッチするのを実行時に失敗するものたち。

source: In Swift, there are two kinds of types: named types and compound types.
ja: スウィフトには、２つの種類の型：名前付きの型と複合の型があります。

source: In Swift, there are ways to modify a value that span several lines of code, making it possible to attempt to access a value in the middle of its own modification.
ja: スウィフトには、複数コード行にまたがるある値を修正する方法があります、それが可能にするのはある値に対してそれ自身の修正の途中でアクセスを試みることです。

source: In Swift, this can be done in a single line:
ja: スウィフトにおいて、これは１つの行でされることができます：

source: In Swift, this would be written as:
ja: スウィフトでは、これはこのように書かれます：

source: In Swift, type information can also flow in the opposite direction—from the root down to the leaves.
ja: スウィフトでは、型情報は逆方向にも流れます ― 根から下って葉っぱまで。

source: In Swift, you can choose whether to define a class, structure, or enumeration, and still have the flexibility to define methods on the type you create.
ja: スウィフトでは、あなたは、クラス、構造体、または列挙を定義すべきかを選択することができます、そしてまだあなたがつくる型でメソッドを定義する柔軟性を持ちます。

source: In Swift, you can define type-level methods for all classes, structures, and enumerations.
ja: スウィフトでは、あなたは全てのクラス、構造体、および列挙のために型レベルのメソッドを定義することができます。

source: In Swift, you can even extend a protocol to provide implementations of its requirements or add additional functionality that conforming types can take advantage of.
ja: スウィフトでは、あなたはプロトコルを拡張してその要件の実装を提供することやそれの準拠型が利用することができる追加の機能性を加えることさえ可能です。

source: In Swift, you can nest loops and conditional statements inside other loops and conditional statements to create complex control flow structures.
ja: スウィフトでは、あなたはループおよび条件文を他のループおよび条件文の中に入れ子にして、複雑な制御の流れの構造を作成できます。

source: In Swift, you define a structure or class in a single file, and the external interface to that class or structure is automatically made available for other code to use.
ja: スウィフトでは、あなたはある構造体またはクラスをある単一のファイルの中で定義します、そして、そのクラスまたは構造体への外部インタフェースは自動的に他のコードが使うことが可能にされます。

source: In Xcode, for example, the print(_:separator:terminator:) function prints its output in Xcode’s “console” pane.
ja: 例えば、Xcodeでは、print(_:separator:terminator:)関数はその出力をXcodeの「コンソール」枠に表示します。

source: In a for statement, the increment expression is still evaluated after the continue statement is executed, because the increment expression is evaluated after the execution of the loop’s body.
ja: for文において、増加式はcontinue文が実行されたあと依然として評価されます、なぜなら増加式がループの本文の実行の後に評価されるためです。

source: In a class declaration, the static keyword has the same effect as marking the declaration with both the class and final declaration modifiers.
ja: クラス宣言において、staticキーワードは、宣言をclassとfinal宣言修飾子の両方で印することと同じ効果を持ちます。

source: In a dictionary literal, the key and value in each key-value pair are separated by a colon.
ja: 辞書リテラルでは、それぞれの「キーと値」の対の中のキーと値は、コロンで区切られます。

source: In a few cases, regular font text is used to describe the right-hand side of a grammar production rule.
ja: ２、３の場合には、標準活字のテキストが説明のために文法導出規則の右側で使われます。

source: In a multiline string literal, writing a backslash (\) at the end of a line omits that line break from the string.
ja: 複数行文字列リテラルにおいて、バックスラッシュ（\）を行の終わりで書くことはそのラインブレークを文字列から省きます。

source: In a mutating method of a value type, you can assign a new instance of that value type to self.
ja: 値型の変更メソッドでは、あなたはselfにその値型の新しいインスタンスを代入することができます。

source: In a nested tuple expression, identifiers at the same level of nesting must be unique.
ja: 入れ子にされたタプル式において、同じ水準の入れ子での識別子それらは特有でなければなりません。

source: In a nonthrowing function, an enclosing do-catch statement must handle the error.
ja: 非スロー関数では、取り囲んでいるdo-catch文がエラーを処理しなければなりません。

source: In a protocol declaration or a protocol member declaration, the Self type refers to the eventual type that conforms to the protocol.
ja: プロトコル宣言またはプロトコルメンバー宣言において、Self型は、そのプロトコルに準拠する結果として起こる型を参照します。

source: In a structure, class, or enumeration declaration, the Self type refers to the type introduced by the declaration.
ja: 構造体、クラス、または列挙宣言において、Self型は、その宣言によって導入される型を参照します。

source: In a throwing function, either an enclosing do-catch statement or the caller must handle the error.
ja: スロー関数では、取り囲んでいるdo-catch文または呼び出し側のどちらかがエラーを処理しなければなりません。

source: In a type method, self refers to the current type in which it occurs.
ja: 型メソッドでは、selfはそれが現れているところの現在の型に言及します。

source: In addition to comparing against specific values, Swift provides several ways for each case to specify more complex matching patterns.
ja: ある特定の値に対して比較することに加えて、スウィフトは、それぞれのケース節のために、より複雑な適合パターンを指定するためのいくつかの方法を用意します。

source: In addition to familiar types, Swift introduces advanced types not found in Objective-C, such as tuples.
ja: よく知られている型に加えて、スウィフトはObjective-Cで見られない先進の型を導入します、例えばタプルのような。

source: In addition to generic functions, Swift enables you to define your own generic types.
ja: 総称体関数に加えて、スウィフトはあなたに独自の総称体型を定義することを可能にします。

source: In addition to its list of protocols, a protocol composition can also contain one class type, which you can use to specify a required superclass.
ja: いくつかのプロトコルからなるそれのリストに加えて、あるプロトコル合成はまた１つのクラス型を含むことができます、それはあなたが必要とされるスーパークラスを指定するのに使用します。

source: In addition to its type property and type methods, LevelTracker tracks an individual player’s progress through the game.
ja: その型プロパティと型メソッドに加えて、LevelTrackerは個々のプレーヤーのゲームを通しての進捗を追います。

source: In addition to matching a pattern with a value, you can extract part or all of a composite value and bind each part to a constant or variable name.
ja: パターンを値とマッチングすることに加えて、あなたはある複合値の部分または全てを抽出して、各部分を定数や変数の名前に結び付ける（束縛する）ことができます。

source: In addition to offering various levels of access control, Swift reduces the need to specify explicit access control levels by providing default access levels for typical scenarios.
ja: アクセス制御のいろいろな水準を提供することに加えて、スウィフトは省略時のアクセス水準を典型的なシナリオのために用意することによって明示的にアクセス制御水準を指定する必要を減らします。

source: In addition to properties, you can use instance variables as a backing store for the values stored in a property.
ja: プロパティに加えて、あなたはインスタンス変数をプロパティに格納される値に対する支援外部記憶として使うことができます。

source: In addition to simple properties that are stored, properties can have a getter and a setter.
ja: 格納される単純なプロパティに加えて、プロパティはゲッター（取得メソッド）とセッター（設定メソッド）を持つことができます。

source: In addition to specifying major version numbers like iOS 8 or macOS 10.10, you can specify minor versions numbers like iOS 11.2.6 and macOS 10.13.3.
ja: メジャーなバージョン数をiOS 8やmacOS 10.10のように指定することに加えて、あなたはマイナーバージョン数を、iOS 11.2.6そしてmacOS 10.13.3のように指定することができます。
